<a href="https://colab.research.google.com/github/Sriharish19/Almax_notes/blob/main/git_sql_notes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# The SQL SELECT Statement

The SELECT statement is used to select data from a database.

The data returned is stored in a result table, called the result-set.

SELECT Syntax

    SELECT column1, column2, ...
    FROM table_name;

To select all the fields available in the table, syntax:

    SELECT * FROM table_name;

The following SQL statement selects the "CustomerName" and "City" columns from the "Customers" table:

    SELECT CustomerName, City FROM Customers;

The **CREATE DATABASE** statement is used to create a new SQL database.

he following SQL statement creates a database called "testDB":

    CREATE DATABASE testDB;

The DROP DATABASE statement is used to drop an existing SQL database.

The following SQL statement drops the existing database "testDB":

    DROP DATABASE testDB;

#The SQL CREATE TABLE Statement

The CREATE TABLE statement is used to create a new table in a database.

Syntax

    CREATE TABLE table_name (

    column1 datatype,

    column2 datatype,

    column3 datatype,

    ....
    );

SQL CREATE TABLE Example

The following example creates a table called "Persons" that contains five columns: PersonID, LastName, FirstName, Address, and City:

Example

    CREATE TABLE Persons (
    PersonID int,
    LastName varchar(255),
    FirstName varchar(255),
    Address varchar(255),
    City varchar(255)
    );

The following SQL creates a new table called "TestTables" (which is a copy of the "Customers" table): 

    
    
    CREATE TABLE TestTable AS
    SELECT customername, contactname
    FROM customers;

The SQL DROP TABLE Statement

The DROP TABLE statement is used to drop an existing table in a database.

Syntax

    DROP TABLE table_name;

The following SQL statement drops the existing table "Shippers":

Example

    DROP TABLE Shippers;

#SQL ALTER TABLE Statement

The ALTER TABLE statement is used to add, delete, or modify columns in an existing table.

The ALTER TABLE statement is also used to add and drop various constraints on an existing table.

ALTER TABLE - ADD Column
To add a column in a table, use the following syntax:

    ALTER TABLE table_name
    ADD column_name datatype;

The following SQL adds an "Email" column to the "Customers" table:

Example

    ALTER TABLE Customers
    ADD Email varchar(255);

#ALTER TABLE - DROP COLUMN

To delete a column in a table, use the following 
syntax (notice that some database systems don't allow deleting a column):

    ALTER TABLE table_name
    DROP COLUMN column_name;

The following SQL deletes the "Email" column from the "Customers" table:

Example

    ALTER TABLE Customers
    DROP COLUMN Email;

ALTER TABLE - RENAME COLUMN

To rename a column in a table, use the following syntax:

ALTER TABLE table_name

    RENAME COLUMN old_name to new_name;

#SQL Create Constraints

Constraints can be specified when the table is created with the CREATE TABLE statement, or after the table is created with the ALTER TABLE statement.

Syntax

    CREATE TABLE table_name (
    column1 datatype constraint,
    column2 datatype constraint,
    column3 datatype constraint,
    ....
    );
**SQL Constraints**

SQL constraints are used to specify rules for the data in a table.

Constraints are used to limit the type of data that can go into a table. This ensures the accuracy and reliability of the data in the table. If there is any violation between the constraint and the data action, the action is aborted.

Constraints can be column level or table level. Column level constraints apply to a column, and table level constraints apply to the whole table.

The following constraints are commonly used in SQL:

* NOT NULL - Ensures that a column cannot have a NULL value
* UNIQUE - Ensures that all values in a column are different
* PRIMARY KEY - A combination of a NOT NULL and UNIQUE. Uniquely identifies each row in a table
* FOREIGN KEY - Prevents actions that would destroy links between tables
* CHECK - Ensures that the values in a column satisfies a specific condition
* DEFAULT - Sets a default value for a column if no value is specified
* CREATE INDEX - Used to create and retrieve data from the database very quickly

#SQL NOT NULL Constraint

By default, a column can hold NULL values.

The NOT NULL constraint enforces a column to NOT accept NULL values.

This enforces a field to always contain a value, which means that you cannot insert a new record, or update a record without adding a value to this field.

SQL NOT NULL on CREATE TABLE

The following SQL ensures that the "ID", "LastName", and "FirstName" columns will NOT accept NULL values when the "Persons" table is created:

Example

    CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255) NOT NULL,
    Age int
    );

#SQL UNIQUE Constraint

The UNIQUE constraint ensures that all values in a column are different.

Both the UNIQUE and PRIMARY KEY constraints provide a guarantee for uniqueness for a column or set of columns.

A PRIMARY KEY constraint automatically has a UNIQUE constraint.

However, you can have many UNIQUE constraints per table, but only one PRIMARY KEY constraint per table.

SQL UNIQUE Constraint on CREATE TABLE

The following SQL creates a UNIQUE constraint on the "ID" column when the "Persons" table is created:

    CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    UNIQUE (ID)
    );

#SQL PRIMARY KEY Constraint

The PRIMARY KEY constraint uniquely identifies each record in a table.

Primary keys must contain UNIQUE values, and cannot contain NULL values.

A table can have only ONE primary key; and in the table, this primary key can consist of single or multiple columns (fields).

**SQL PRIMARY KEY on CREATE TABLE**

The following SQL creates a PRIMARY KEY on the "ID" column when the "Persons" table is created:

MySQL:

    CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    PRIMARY KEY (ID)
    );

SQL FOREIGN KEY Constraint

The FOREIGN KEY constraint is used to prevent actions that would destroy links between tables.

A FOREIGN KEY is a field (or collection of fields) in one table, that refers to the PRIMARY KEY in another table.

SQL FOREIGN KEY on CREATE TABLE

The following SQL creates a FOREIGN KEY on the "PersonID" column when the "Orders" table is created:

MySQL:

    CREATE TABLE Orders (
    OrderID int NOT NULL,
    OrderNumber int NOT NULL,
    PersonID int,
    PRIMARY KEY (OrderID),
    FOREIGN KEY (PersonID) REFERENCES Persons(PersonID)
    );

**DROP a FOREIGN KEY Constraint**

To drop a FOREIGN KEY constraint, use the following SQL:

MySQL:

    ALTER TABLE Orders
    DROP FOREIGN KEY FK_PersonOrder;

#SQL CHECK Constraint

The CHECK constraint is used to limit the value range that can be placed in a column.

If you define a CHECK constraint on a column it will allow only certain values for this column.

If you define a CHECK constraint on a table it can limit the values in certain columns based on values in other columns in the row.

**SQL CHECK on CREATE TABLE**

The following SQL creates a CHECK constraint on the "Age" column when the "Persons" table is created. The CHECK constraint ensures that the age of a person must be 18, or older:

MySQL:

    CREATE TABLE Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255),
    Age int,
    CHECK (Age>=18)
    );

#SQL IFNULL(), ISNULL(), COALESCE()

MySQL

The MySQL IFNULL() function lets you return an alternative value if an expression is NULL:

    SELECT ProductName, UnitPrice * (UnitsInStock + IFNULL(UnitsOnOrder, 0))
    FROM Products;

or we can use the COALESCE() function, like this:

    SELECT ProductName, UnitPrice * (UnitsInStock + COALESCE(UnitsOnOrder, 0))
    FROM Products;

# The SQL WHERE Clause

The WHERE clause is used to filter records.

It is used to extract only those records that fulfill a specified condition.

WHERE Syntax

    SELECT column1, column2, ...
    FROM table_name
    WHERE condition;

Note: The WHERE clause is not only used in SELECT statements, it is also used in UPDATE, DELETE, etc.!

The following SQL statement selects all the customers from the country "Mexico", in the "Customers" table:

    SELECT * FROM Customers
    WHERE Country='Mexico';

SQL requires single quotes around text values (most database systems will also allow double quotes).

However, numeric fields should not be enclosed in quotes:

    SELECT * FROM Customers
    WHERE CustomerID=1;

# The SQL COUNT(), AVG() and SUM() Functions

The COUNT() function returns the number of rows that matches a specified criterion.

COUNT() Syntax

    SELECT COUNT(column_name)
    FROM table_name
    WHERE condition;

The following SQL statement finds the number of products:

    SELECT COUNT(ProductID)
    FROM Products;

The AVG() function returns the average value of a numeric column.

AVG() Syntax

    SELECT AVG(column_name)
    FROM table_name
    WHERE condition;

The following SQL statement finds the average price of all products:

    SELECT AVG(Price)
    FROM Products;

Note: NULL values are ignored.

The SUM() function returns the total sum of a numeric column. 

SUM() Syntax

    SELECT SUM(column_name)
    FROM table_name
    WHERE condition;

The following SQL statement finds the sum of the "Quantity" fields in the "OrderDetails" table:

    SELECT SUM(Quantity)
    FROM OrderDetails;

 NULL values are ignored.


**The SQL MIN() and MAX() Functions**

The MIN() function returns the smallest value of the selected column.

The MAX() function returns the largest value of the selected column.

MIN() Syntax

    SELECT MIN(column_name)
    FROM table_name
    WHERE condition;

The following SQL statement finds the price of the cheapest product:

    SELECT MIN(Price) AS SmallestPrice
    FROM Products;

MAX() Syntax

    SELECT MAX(column_name)
    FROM table_name
    WHERE condition;

The following SQL statement finds the price of the most expensive product:

    SELECT MAX(Price) AS LargestPrice
    FROM Products;

#The SQL GROUP BY Statement

The GROUP BY statement groups rows that have the same values into summary rows, like "find the number of customers in each country".

The GROUP BY statement is often used with aggregate functions (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.

GROUP BY Syntax

    SELECT column_name(s)
    FROM table_name
    WHERE condition
    GROUP BY column_name(s)
    ORDER BY column_name(s);

The following SQL statement lists the number of customers in each country:

    SELECT COUNT(CustomerID), Country
    FROM Customers
    GROUP BY Country;

The following SQL statement lists the number of customers in each country, sorted high to low:

    SELECT COUNT(CustomerID), Country
    FROM Customers
    GROUP BY Country
    ORDER BY COUNT(CustomerID) DESC;

The following SQL statement lists the number of orders sent by each shipper:

    SELECT Shippers.ShipperName, COUNT(Orders.OrderID) AS NumberOfOrders FROM Orders
    LEFT JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID
    GROUP BY ShipperName;

# The SQL HAVING Clause

The HAVING clause was added to SQL because the WHERE keyword cannot be used with aggregate functions.

HAVING Syntax

    SELECT column_name(s)
    FROM table_name
    WHERE condition
    GROUP BY column_name(s)
    HAVING condition
    ORDER BY column_name(s);

The following SQL statement lists the number of customers in each country. Only include countries with more than 5 customers:

Example

    SELECT COUNT(CustomerID), Country
    FROM Customers
    GROUP BY Country
    HAVING COUNT(CustomerID) > 5;

The following SQL statement lists the number of customers in each country, sorted high to low (Only include countries with more than 5 customers):

    SELECT COUNT(CustomerID), Country
    FROM Customers
    GROUP BY Country
    HAVING COUNT(CustomerID) > 5
    ORDER BY COUNT(CustomerID) DESC;

#The SQL SELECT DISTINCT Statement
The SELECT DISTINCT statement is used to return only distinct (different) values.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values.

SELECT DISTINCT Syntax

    SELECT DISTINCT column1, column2, ...
    FROM table_name;
The following SQL statement selects only the DISTINCT values from the "Country" column in the "Customers" table:

    SELECT DISTINCT Country FROM Customers;

The following SQL statement lists the number of different (distinct) customer countries:

    SELECT COUNT(DISTINCT Country) FROM Customers;

    SELECT Count(*) AS DistinctCountries
    FROM (SELECT DISTINCT Country FROM Customers);

#SQL INNER JOIN Keyword

The INNER JOIN keyword selects records that have matching values in both tables.

INNER JOIN Syntax

    SELECT column_name(s)
    FROM table1
    INNER JOIN table2
    ON table1.column_name = table2.column_name;

The following SQL statement selects all orders with customer information:


    SELECT Orders.OrderID, Customers.CustomerName
    FROM Orders
    INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID;

Note: The INNER JOIN keyword selects all rows from both tables as long as there is a match between the columns. If there are records in the "Orders" table that do not have matches in "Customers", these orders will not be shown!

The following SQL statement selects all orders with customer and shipper information:

    SELECT Orders.OrderID, Customers.CustomerName, Shippers.ShipperName
    FROM ((Orders
    INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID)
    INNER JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID);

#SQL LEFT JOIN Keyword

The LEFT JOIN keyword returns all records from the left table (table1), and the matching records from the right table (table2). The result is 0 records from the right side, if there is no match.

LEFT JOIN Syntax

    SELECT column_name(s)
    FROM table1
    LEFT JOIN table2
    ON table1.column_name = table2.column_name;

The LEFT JOIN keyword returns all records from the left table (Customers), even if there are no matches in the right table (Orders).

The following SQL statement will select all customers, and any orders they might have:

    SELECT Customers.CustomerName, Orders.OrderID
    FROM Customers
    LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID
    ORDER BY Customers.CustomerName;

# SQL FULL OUTER JOIN Keyword

The FULL OUTER JOIN keyword returns all records when there is a match in left (table1) or right (table2) table records.

FULL OUTER JOIN and FULL JOIN are the same.

FULL OUTER JOIN Syntax

    SELECT column_name(s)
    FROM table1
    FULL OUTER JOIN table2
    ON table1.column_name = table2.column_name
    WHERE condition;

The following SQL statement selects all customers, and all orders:

    SELECT Customers.CustomerName, Orders.OrderID
    FROM Customers
    FULL OUTER JOIN Orders ON Customers.CustomerID=Orders.CustomerID
    ORDER BY Customers.CustomerName;

The FULL OUTER JOIN keyword returns all matching records from both tables whether the other table matches or not. So, if there are rows in "Customers" that do not have matches in "Orders", or if there are rows in "Orders" that do not have matches in "Customers", those rows will be listed as well.

#The SQL UNION Operator

The UNION operator is used to combine the result-set of two or more SELECT statements.

Every SELECT statement within UNION must have the same number of columns
The columns must also have similar data types

The columns in every SELECT statement must also be in the same order

UNION Syntax

    SELECT column_name(s) FROM table1
    UNION
    SELECT column_name(s) FROM table2;

The following SQL statement returns the cities (only distinct values) from both the "Customers" and the "Suppliers" table:

Example
    SELECT City FROM Customers
    UNION
    SELECT City FROM Suppliers
    ORDER BY City;

UNION ALL Syntax

The UNION operator selects only distinct values by default. To allow duplicate values, use UNION ALL:

    SELECT column_name(s) FROM table1
    UNION ALL
    SELECT column_name(s) FROM table2;

Note: The column names in the result-set are usually equal to the column names in the first SELECT statement.

The following SQL statement returns the cities (duplicate values also) from both the "Customers" and the "Suppliers" table:

Example

    SELECT City FROM Customers
    UNION ALL
    SELECT City FROM Suppliers
    ORDER BY City;

#SQL Dates


MySQL comes with the following data types for storing a date or a date/time value in the database:

DATE - format YYYY-MM-DD

DATETIME - format: YYYY-MM-DD HH:MI:SS

TIMESTAMP - format: YYYY-MM-DD HH:MI:SS

YEAR - format YYYY or YY

We use the following SELECT statement:

    SELECT * FROM Orders WHERE OrderDate='2008-11-11'

Two dates can easily be compared if there is no time component involved!